/**
 * Copyright 2016 JustWayward Team
 * <p>
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 * <p>
 * http://www.apache.org/licenses/LICENSE-2.0
 * <p>
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
package com.justwayward.reader.bean;

import com.justwayward.reader.bean.base.Base;

/**
 * Created by lfh on 2016/9/1.
 * 书荒区帖子详情
 */
public class BookHelp extends Base{

    /**
     * _id : 579df15f8eaf3ec231d8bc2b
     * type : help
     * author : {"_id":"54ec360d77bace32513eabc1",
     * "avatar":"/avatar/f1/ca/f1cad586d81253f48b360738b1b90780","nickname":"万剑一","type":"doyen",
     * "lv":9,"gender":"male","rank":null,"created":"2015-02-24T08:27:57.000Z",
     * "id":"54ec360d77bace32513eabc1"}
     * title : 16-8养肥书单
     * content : 有些评论不是我写的，但是我尽量挑公允一点的。

     《皇帝直播间》
     UP主魂穿高武位面的小国纨绔庶皇子，金手指系统+千千万万直播网友，创意满分，文笔平均偏下水准，文中皇帝设定正值壮年+性格多疑，争夺封王位比立功，五皇子散财赈灾，男主拉出一个前世制图专业的设定靠画地图强行当功劳，你了解本国国情吗？知道你爹喜文喜武吗？如果你爹怀疑你借机卖人情给武将或是私下里和武将来往怎么办？与其如此倒不如以五年内成为封圣强者为比试内容（五皇子方也可以选择拉拢一位封圣强者对皇帝效忠）更为妥当，首先这任务你办不到得死，硬条件，第二这个比试不涉及朝堂权力斗争，一个封圣强者拥有灭国级别的核弹实力，成不了男主死五皇子上位，成了自然而然就有自己的势力，夺嫡登基更有竞争力。

     《重生之抠脚大汉变男神》
     我想评价这本书的时候我必须要再一次抬出这句话了：“一本书的主角其实是作者本身特质的折射”，所以我猜测作者应该是一位拥有少女心的抠脚大汉，在闲暇午睡时来了一场如同成人童话一般的梦中重生之旅。然后，就有了这本书。虽然脱胎于某种逗比小白文的文字风格很有趣，但这类文总有一个后劲不强容易腻的通病，所以后续如何要看作者的功力。哦对了，为什么我说这书脱胎逗比小白文，因为有一些情节实在是太幼稚了，忽略那些毒点是可看的。

     《气吞寰宇》
     教主的新书，先养着

     《百年家书》
     作者文笔很好，实体风，也表现出民国的波澜壮阔。但是文风看的很累，加上写的是那个残酷的年代就更累了。
     按我的说法，不会刻意去找这本书，但如果在书店碰到会买下来。但是平常在网上不会选择阅读这类书。原因不管是爽文还是虐文，看着不会累，毕竟看网络小说就是为了消遣娱乐。但是你会在休息时间在网上看悲惨世界，围城之类的名著吗？这种书还是适合实体

     《红龙》
     异世-异类，量大管饱，更新较慢，著名异类文兼气管炎老司机接口卡的老坑，讲述主角死后重生为一条与众不同的红龙睡觉或破坏的日常，从用牙齿种出管钱的女儿到体内长出核反应堆。目前已变成为眼里只剩母蜥蜴的淫龙，果断上了亲妹。

     《韩警官》
     很有味道的一本官场刑侦小说，主角重生怀疑自己做梦，家庭和睦，仕途顺利，主角慢慢向警察发展，很喜欢里面的风格，九十年代的气息扑面而来，那时候的精气神，基层人民的生活，都很好的展示出来了。作者安排的金手指大多是主角的个人道德修养吧，谦虚周到理智精明，剧情上的硬伤倒是没怎么发现。单看前几章作者对主角的安排——整顿夜市、参加律师考试，就能看出作者的精心经营，慢慢雕琢的主角谁不喜欢呢？现实中读者大多没有目的性，那么网文中行事有条理有强烈目的性的主角自然会得到众人的欢心了。另，提醒：这本几乎没有明显的装逼打脸情节，不要拿一般官场文度之，恩，比余罪严肃很多。

     《特拉福买家俱乐部》
     首先主角三观较正，并非见钱眼开，交易了就什么都不管的主，甚至遇到了那种穷凶极恶的交易者，还会体现出些许另类的「侠者之气」，看了不难受。
     第二，文笔不错，行文流畅，顺带一提对于人偶妹子的描写让我这个轻度人偶控相当的受用。
     第三，这本小说好像有那啥的倾向....不说太多，给你们四个字「圣母降临」，也是坛子里作者的作品，老司机们自然就明白了。

     《柯南世界里的巫师》
     作为柯南同人居然敢穿插奇门异术的力量体系，暗世界的设定可见作者魄力，这么一写俨然是鹤立鸡群，新意突显啊。文笔虽谈不上上上之选但也是流畅无阻，可以说是柯南同人中鲜有的佳作。不足之处在于感情描写颇是仓促缺乏点睛之笔，人物形象略显单一苍白。

     《大明1630》
     总体来说还是有干粮水平的，主角国姓爷身份的切入点也挺特别，里面几段主角立论也写得挺好。主要问题在于部分对话用语太现代，会冒出有些可能没有的词汇，还有一个攀科技树的小说一般都会出现不太切合实际这个问题。

     《重生之出人头地》
     沧海的马甲，真正的智斗流，写的比本尊那本兵锋无双好，沧海还是最适合写香港。各种细节信手拈來，现实和电影糅合在一起，那不是香港又是香港，那就是我们心目中的香港江湖。

     《放开那个女巫》
     很多人都说好的书，的确很好。仙草-。主角来到个类似中世纪（冰与火？）的时代，拯救了一群女巫，利用女巫的超能力快速发展工业，用钢铁枪炮与兄弟姐妹争夺王位的故事。好吧，虽然是中世纪发展工业，不过看点完全不在这！最大的看点是，在最黑暗的年代，主角王子扮演救世主的角色，拯救了一群被残酷迫害的女巫妹子的故事。这是多么伟大和圣母啊！！哈哈，不完全是开玩笑，工业什么的看看就行了，最好看的还是主角和妹子的互动。

     《我的魔法时代》
     穿越玄幻类小说，从5岁写起，整体氛围很好，没那么多戾气，文笔好。但是相应的主角的心态上感觉有些弱鸡。慢热 好看就是更的慢 又的养了。

     《暗影圣贤》
     作者这么爱吐槽为什么不干脆写一本逗逼文呢？上本这样，这本也是，不说写出史诗感至少也应该严肃点，插进去的各种明显是作者的无厘头吐槽配上救世题材……

     《绝顶枪王》
     本文选择的游戏是枪战类。之后主角做游戏通关任务，妙趣横生，又很能体现主角的实力。作者这样把竞技和游戏任务结合在一起写，很赞，至少节奏把握的很好。生活情节虽然满满热血漫的既视感，但作者把握住了风格，青春热血，激情奋斗的味道写出来了，这也就够了。对比作者的上一本书，感觉这次进步很大，作者比较擅长写这方面的故事，期待作者能保持水平，继续进步。

     《这锅我不背》
     晋江位面的特产——搞基文，不喜勿入。 脑洞巨大，创意独特，非常有意思的小说，作者的脑回路有异于常人，看这本书看看创意还是蛮爽的，搞基部分自动屏蔽就好了

     《从酋长到球长》
     看着就能感觉作者的写作水平又提高了，额，或者说这个作者本来的文字水平就是顶尖一系列的，写这本书的过程中逐渐熟悉了网文读者的好恶，努力的去写成一本网文。这么说或者有点乱，不过大概可以理解为用平铺直叙的方式来讲一个故事的情况下让你感觉到文字的美感。并且情节的把控上水平也有所提高。而且作者没有范文青病，最近的文字在超好的文笔与文青之间，非常好的把握住了那个度，让人看起来非常舒服。好书不容错过。

     《[综]天生反派》
     这根本就是个男版林黛玉，既不能做到有恩报恩，又不能做到有仇报仇，每次都是病殃殃的让别人可怜，最后英年早逝把所有关心他的人伤害个遍，真是个废物。

     《远东王庭》
     颇为有趣的DND作品，金手指虽然巴拉巴拉解释了一连串，但是和系统流差别其实不是很大。 作者应该是老作者，很明白怎么在爽的同时调整主角的进步速度。

     《魔神乐园》
     主流小白文的模板，准一流的打斗描写。为了配合小白文写法，反派的魅力被削弱很多。 支线加入同伴的描写，比前两本进步，有亮点。 总体来说：可以一看，有毒点，跳着看还不错。

     这次书不多，主要这半年也没什么好书，说实话
     * state : distillate
     * updated : 2016-09-01T09:11:39.597Z
     * created : 2016-07-31T12:38:55.286Z
     * commentCount : 256
     * shareLink : http://share.zhuishushenqi.com/post/579df15f8eaf3ec231d8bc2b
     * id : 579df15f8eaf3ec231d8bc2b
     */

    public HelpBean help;

    public static class HelpBean {
        public String _id;
        public String type;
        /**
         * _id : 54ec360d77bace32513eabc1
         * avatar : /avatar/f1/ca/f1cad586d81253f48b360738b1b90780
         * nickname : 万剑一
         * type : doyen
         * lv : 9
         * gender : male
         * rank : null
         * created : 2015-02-24T08:27:57.000Z
         * id : 54ec360d77bace32513eabc1
         */

        public AuthorBean author;
        public String title;
        public String content;
        public String state;
        public String updated;
        public String created;
        public int commentCount;
        public String shareLink;
        public String id;

        public static class AuthorBean {
            public String _id;
            public String avatar;
            public String nickname;
            public String type;
            public int lv;
            public String gender;
            public Object rank;
            public String created;
            public String id;
        }
    }
}
